SLS/src/Catalogs/ГруппыПолучателейРассылок/ГруппыПолучателейРассылок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПолучателейРассылок</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОповещениеTelegram</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TelegramBot</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиTelegram</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещениеПоПочте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Отключить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Копии</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Отключить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыПолучатели</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.ПочтовыеГруппыИЧаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Отключить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыКопии</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.ПочтовыеГруппыИЧаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Отключить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SLS/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <basedOn>Document.Встреча</basedOn>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоИсходящее</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <comment>Дата рождения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <comment>Пол</comment>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SLS/src/Catalogs/ГруппыПолучателейРассылок/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьПолучателяВПриемник(Приемник, Получатель, Линк, ЗаполнениеПользователей = Ложь, ЗаполнитьПредставленияВСписке = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Получатель) Тогда
		Возврат;
	КонецЕсли;
	
	ИзПисьма 		= ТипЗнч(Приемник) = Тип("ИнтернетПочтовыеАдреса");
	ИзФормыСписком 	= ТипЗнч(Приемник) = Тип("СписокЗначений");
	
	Если ЗаполнениеПользователей И НЕ ИзПисьма Тогда
		
		Если ТипЗНЧ(Приемник) = Тип("СписокЗначений") Тогда
			Если Приемник.НайтиПоЗначению(Получатель) = Неопределено Тогда
				Приемник.Добавить(Получатель);
			КонецЕсли;
		Иначе
			Если Приемник.Найти(Получатель) = Неопределено Тогда
				Приемник.Добавить(Получатель);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		Адрес = _Почта.ПолучитьАдресПользователя(Получатель, Линк);
		Если ЗначениеЗаполнено(Адрес) Тогда
			
			Если ИзПисьма Тогда
				НовПолучатель = Приемник.Добавить(Адрес);
			Иначе
				
				//Приемник.Добавить(Адрес, Получатель.Получатель);
				Если ТипЗНЧ(Приемник) = Тип("СписокЗначений") Тогда
					Если Приемник.НайтиПоЗначению(Адрес) = Неопределено Тогда
						Приемник.Добавить(Адрес, Получатель);
					КонецЕсли;
				Иначе
					Если Приемник.Найти(Адрес) = Неопределено Тогда
						Приемник.Добавить(Адрес);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДобавитьПолучателей(Приемник, Источник, Линк, ДобавитьТекущего = Ложь, ЗаполнениеПользователей = Ложь,ЗаполнитьПредставленияВСписке = Ложь) Экспорт
	
	ИзПисьма 		= ТипЗнч(Приемник) = Тип("ИнтернетПочтовыеАдреса");
	ИзФормыСписком 	= ТипЗнч(Приемник) = Тип("СписокЗначений");
	
	Для Каждого Получатель Из Источник Цикл
		
		Если Получатель.Отключить Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавитьПолучателяВПриемник(Приемник, Получатель.Получатель, Линк, ЗаполнениеПользователей); 
		
	КонецЦикла;

	Если ДобавитьТекущего Тогда
		
		ТекПользователь = Пользователи.АвторизованныйПользователь();
		Если Источник.Найти(ТекПользователь, "Получатель") = Неопределено
			И Источник.Найти(ТекПользователь.ФизическоеЛицо, "Получатель") = Неопределено
			Тогда
			
			ДобавитьПолучателяВПриемник(Приемник, ТекПользователь.ФизическоеЛицо, Линк, ЗаполнениеПользователей); 
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
		
Процедура ЗаполнитьМассивАдресатовРассылки(Рассылка, Линк = Ложь, ИмяТЧ = "Получатели", мАдреса, ДобавитьТекущего = Ложь, ЗаполнениеПользователей = Ложь, ЗаполнитьПредставленияВСписке = Ложь) Экспорт
	
	ПроверитьДобавитьПолучателей(мАдреса, Рассылка[СокрЛП(ИмяТЧ)],				Линк, ДобавитьТекущего,	ЗаполнениеПользователей, ЗаполнитьПредставленияВСписке);
	ПроверитьДобавитьПолучателей(мАдреса, Рассылка["Группы" + СокрЛП(ИмяТЧ)],	Линк, Ложь,				ЗаполнениеПользователей, ЗаполнитьПредставленияВСписке);
	
КонецПроцедуры

Функция ВсеПолучателейГруппы(Рассылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Рассылка", Рассылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыПолучателейРассылокПолучатели.Получатель КАК Получатель
	|ИЗ
	|	Справочник.ГруппыПолучателейРассылок.Получатели КАК ГруппыПолучателейРассылокПолучатели
	|ГДЕ
	|	ГруппыПолучателейРассылокПолучатели.Ссылка = &Рассылка
	|	И НЕ ГруппыПолучателейРассылокПолучатели.Отключить
	|	И ГруппыПолучателейРассылокПолучатели.Получатель <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГруппыПолучателейРассылокПолучатели.Получатель
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ГруппыПолучателейРассылокКопии.Получатель
	|ИЗ
	|	Справочник.ГруппыПолучателейРассылок.Копии КАК ГруппыПолучателейРассылокКопии
	|ГДЕ
	|	ГруппыПолучателейРассылокКопии.Ссылка = &Рассылка
	|	И НЕ ГруппыПолучателейРассылокКопии.Отключить
	|	И ГруппыПолучателейРассылокКопии.Получатель <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГруппыПолучателейРассылокКопии.Получатель";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Получатель");
	
КонецФункции

#КонецОбласти

#КонецЕсли
